---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.UnspecifiedError
source: html/f01bd113-5099-fa8f-fa8e-1fb8fe8d5dfe.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.UnspecifiedError Property

Revit has experienced an unexpected error. The operation has been cancelled to protect your project from corruption.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnspecifiedError { get; }
```